Ret395/bulk/kOmegaSST/AHFM/Pr0.71/mesh4/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{

    inlet
    {
        type            cyclic;
        value           $internalField;
    }

    outlet
    {
        type            cyclic;
        value           $internalField;
    }

    bottom
    {
        type            fixedFluxPressure;
    }

    top
    {
        type            fixedFluxPressure;
    }

    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
